{"posts":[{"title":"Starting Up...","text":"I just started my graduate career as an Applied Mathematics Ph.D. student at Harvard University. I’m particularly interested in research that blends mathematics with computing, and I’m lucky to be joining the Computational Science and Engineering Lab (CSE Lab), led by Dr. Petros Koumoutsakos. The interdisciplinary nature of applied mathematics makes it notoriously difficult to characterize (A book I read this summer, Axiomatics by Alma Steingart, mentions a few notable attempts by prominent mathematicians), but I recently came across a characterization of a particular subfield, Scientific Machine Learning (SciML), that aligns quite well with some of my interests. The discussion came from the introductory lecture of ETH Zurich’s Deep Learning in Scientific Computing course, available here. I had heard of many of the ideas associated with SciML before, but I had never seen a unifying description of the field nor been exposed to any of the techniques in detail (If you’re curious what I worked on before, all my undergraduate research was in computational physics). I don’t know exactly how synergetic SciML ideas will be with the particular problems I encounter in my CSE Lab research, but I think a great way to kick off this blog is to explore the field and share the things I learn along the way. Since I’m brand new to the SciML space, I hope that documenting my progress will offer an interesting perspective for others who interact with the field. Importantly, I imagine I’ll make a ton of mistakes, misunderstand ideas, and leave out insights along the way, so please don’t hesitate to tell me when I do. I’ve taken a cursory look at some of SciML’s applications, and I think an exciting (yet definitely ambitious) goal would be to try to construct some sort of large-scale digital twin simulation or model a complex engineering problem like the flow over a 3D heat sink. I’m sure this goal will evolve as I learn more and get a better sense of what my workload will be like (I’ll be doing this in my free time), but I’ll start here and see what happens. Of course, I’ll also be mixing in posts about whatever else I come across that I think is interesting and worth sharing.","link":"/blog/2023/09/10/starting/"}],"tags":[],"categories":[],"pages":[]}